Environment: dev. Pipeline Stage: dev
Plan has been truncated:
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.app will be created
  + resource "azurerm_resource_group" "app" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-xwc-app-001"
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-1"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-cloud-agent-1"
        name                = "xwc-cloud-agent-1"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-cloud-agent-1"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "2"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-11T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "Gold1",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-2"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-cloud-agent-2"
        name                = "xwc-cloud-agent-2"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-cloud-agent-2"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "3"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-11T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "Gold2",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-test"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-cloud-agent-test"
        name                = "xwc-cloud-agent-test"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-cloud-agent-test"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "1"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-11T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "test",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-device-manager"
        name                = "xwc-device-manager"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-device-manager"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "2"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-11T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "Gold1",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager-test"] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
        id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Resources/deployments/xwc-device-manager-test"
        name                = "xwc-device-manager-test"
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - resources      = [
                  - {
                      - apiVersion = "2019-06-01"
                      - name       = "auto-xwc-core-001/xwc-device-manager-test"
                      - properties = {
                          - scheduleInfo        = {
                              - advancedSchedule = {
                                  - monthlyOccurrences = [
                                      - {
                                          - day        = "Saturday"
                                          - occurrence = "1"
                                        },
                                    ]
                                }
                              - frequency        = "Month"
                              - interval         = "1"
                              - startTime        = "2022-01-11T01:00:00Z"
                              - timeZone         = "UTC"
                            }
                          - updateConfiguration = {
                              - azureVirtualMachines  = []
                              - duration              = "PT2H"
                              - nonAzureComputerNames = []
                              - operatingSystem       = "windows"
                              - targets               = {
                                  - azureQueries    = [
                                      - {
                                          - locations   = []
                                          - scope       = [
                                              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001",
                                            ]
                                          - tagSettings = {
                                              - filterOperator = "All"
                                              - tags           = {
                                                  - UpdateClass = [
                                                      - "test",
                                                    ]
                                                }
                                            }
                                        },
                                    ]
                                  - nonAzureQueries = []
                                }
                              - windows               = {
                                  - excludedKbNumbers             = []
                                  - includedUpdateClassifications = "Critical, Security, UpdateRollup, ServicePack, Definition, Updates"
                                  - rebootSetting                 = "IfRequired"
                                }
                            }
                        }
                      - type       = "Microsoft.Automation/automationAccounts/softwareUpdateConfigurations"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca01"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca01/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca01" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca01" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca02"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca02/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwcca02" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca02" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca01"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca01/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca01" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca01" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca02"] must be replaced
-/+ resource "azurerm_backup_protected_vm" "VM_VAULT" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca02/protectedItems/VM;iaasvmcontainerv2;rg-xwc-core-001;vmxwctestca02" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
      ~ source_vm_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca02" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01" -> (known after apply)
        name                 = "lbxwcca01"
      ~ private_ip_address   = "10.193.160.15" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.193.160.15",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/frontendIPConfigurations/fe-lbxwcca01" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
            ] -> (known after apply)
            name                                               = "fe-lbxwcca01"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb" "load_balancer" {
      ~ id                   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01" -> (known after apply)
        name                 = "lbxwctestca01"
      ~ private_ip_address   = "10.193.160.132" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.193.160.132",
        ] -> (known after apply)
      ~ resource_group_name  = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                 = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ availability_zone                                  = "Zone-Redundant" -> (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/frontendIPConfigurations/fe-lbxwctestca01" -> (known after apply)
          ~ inbound_nat_rules                                  = [] -> (known after apply)
          ~ load_balancer_rules                                = [
              - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
            ] -> (known after apply)
            name                                               = "fe-lbxwctestca01"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          ~ zones                                              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01" -> (known after apply) # forces replacement
        name                      = "be-lbxwcca01"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool" "backend_pool" {
      ~ backend_ip_configurations = [] -> (known after apply)
      ~ id                        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply)
      ~ load_balancing_rules      = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
        ] -> (known after apply)
      ~ loadbalancer_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01" -> (known after apply) # forces replacement
        name                      = "be-lbxwctestca01"
      ~ outbound_rules            = [] -> (known after apply)
      ~ resource_group_name       = "rg-xwc-core-001" -> (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01/addresses/be-pool-ip-vmxwcca01" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca01"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca02"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01/addresses/be-pool-ip-vmxwcca02" -> (known after apply)
        name                    = "be-pool-ip-vmxwcca02"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwctestca01"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01/addresses/be-pool-ip-vmxwctestca01" -> (known after apply)
        name                    = "be-pool-ip-vmxwctestca01"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwctestca02"] must be replaced
-/+ resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      ~ backend_address_pool_id = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply) # forces replacement
      ~ id                      = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01/addresses/be-pool-ip-vmxwctestca02" -> (known after apply)
        name                    = "be-pool-ip-vmxwctestca02"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/probes/rule-3389-lbxwcca01" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
        ] -> (known after apply)
      ~ loadbalancer_id     = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01" -> (known after apply) # forces replacement
        name                = "rule-3389-lbxwcca01"
      ~ protocol            = "Tcp" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/probes/rule-3389-lbxwctestca01" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
        ] -> (known after apply)
      ~ loadbalancer_id     = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01" -> (known after apply) # forces replacement
        name                = "rule-3389-lbxwctestca01"
      ~ protocol            = "Tcp" -> (known after apply)
      ~ resource_group_name = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply)
      ~ backend_address_pool_ids       = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01",
        ] -> (known after apply)
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/frontendIPConfigurations/fe-lbxwcca01" -> (known after apply)
      ~ id                             = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ loadbalancer_id                = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01" -> (known after apply) # forces replacement
        name                           = "rule-3389-lbxwcca01"
      ~ probe_id                       = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/probes/rule-3389-lbxwcca01" -> (known after apply)
      ~ resource_group_name            = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply)
      ~ backend_address_pool_ids       = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01",
        ] -> (known after apply)
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/frontendIPConfigurations/fe-lbxwctestca01" -> (known after apply)
      ~ id                             = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ loadbalancer_id                = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01" -> (known after apply) # forces replacement
        name                           = "rule-3389-lbxwctestca01"
      ~ probe_id                       = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/probes/rule-3389-lbxwctestca01" -> (known after apply)
      ~ resource_group_name            = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca01"] must be replaced
-/+ resource "azurerm_network_interface" "NIC" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcca01" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "yhgkp4k5gecefhbkzfdsuybuyc.zx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "00-0D-3A-D4-93-9F" -> (known after apply)
        name                          = "nic1-vmxwcca01"
      ~ private_ip_address            = "10.193.160.16" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.193.160.16",
        ] -> (known after apply)
      ~ resource_group_name           = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                          = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca01" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "ipconfig1"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
            # (3 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca02"] must be replaced
-/+ resource "azurerm_network_interface" "NIC" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcca02" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "yhgkp4k5gecefhbkzfdsuybuyc.zx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "00-0D-3A-7F-7F-6A" -> (known after apply)
        name                          = "nic1-vmxwcca02"
      ~ private_ip_address            = "10.193.160.17" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.193.160.17",
        ] -> (known after apply)
      ~ resource_group_name           = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                          = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca02" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "ipconfig1"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
            # (3 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwctestca01"] must be replaced
-/+ resource "azurerm_network_interface" "NIC" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwctestca01" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "yhgkp4k5gecefhbkzfdsuybuyc.zx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "00-0D-3A-D4-9C-45" -> (known after apply)
        name                          = "nic1-vmxwctestca01"
      ~ private_ip_address            = "10.193.160.133" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.193.160.133",
        ] -> (known after apply)
      ~ resource_group_name           = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                          = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca01" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "ipconfig1"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
            # (3 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwctestca02"] must be replaced
-/+ resource "azurerm_network_interface" "NIC" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwctestca02" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "yhgkp4k5gecefhbkzfdsuybuyc.zx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "00-0D-3A-7F-79-C0" -> (known after apply)
        name                          = "nic1-vmxwctestca02"
      ~ private_ip_address            = "10.193.160.134" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.193.160.134",
        ] -> (known after apply)
      ~ resource_group_name           = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                          = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id            = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca02" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "ipconfig1"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address_allocation                      = "Static" -> "static"
            # (3 unchanged attributes hidden)
        }
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwcca01"] must be replaced
-/+ resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca01" -> (known after apply)
        name                             = "vmxwcca01"
      ~ network_interface_ids            = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcca01",
        ] -> (known after apply)
      ~ resource_group_name              = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                             = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
            "UpdateClass"      = "Gold1"
        }
      ~ vm_size                          = "Standard_D4_v4" -> "Standard_D4_V4"
        # (5 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [] -> (known after apply)
          ~ principal_id = "09fc2d3a-91b5-43f5-87a3-eab78dce776e" -> (known after apply)
          ~ type         = "SystemAssigned" -> (known after apply)
        }

      ~ os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


      ~ storage_data_disk {
          ~ caching                   = "None" -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/data-vmxwcca01" -> (known after apply)
            name                      = "data-vmxwcca01"
            # (5 unchanged attributes hidden)
        }


      ~ storage_os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/os-vmxwcca01" -> (known after apply)
            name                      = "os-vmxwcca01"
          ~ os_type                   = "Windows" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwcca02"] must be replaced
-/+ resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca02" -> (known after apply)
        name                             = "vmxwcca02"
      ~ network_interface_ids            = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcca02",
        ] -> (known after apply)
      ~ resource_group_name              = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                             = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
            "UpdateClass"      = "Gold2"
        }
      ~ vm_size                          = "Standard_D4_v4" -> "Standard_D4_V4"
        # (5 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [] -> (known after apply)
          ~ principal_id = "6f72c2e8-4b88-41a2-aa85-12083b25f8a3" -> (known after apply)
          ~ type         = "SystemAssigned" -> (known after apply)
        }

      ~ os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


      ~ storage_data_disk {
          ~ caching                   = "None" -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/data-vmxwcca02" -> (known after apply)
            name                      = "data-vmxwcca02"
            # (5 unchanged attributes hidden)
        }


      ~ storage_os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/os-vmxwcca02" -> (known after apply)
            name                      = "os-vmxwcca02"
          ~ os_type                   = "Windows" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwctestca01"] must be replaced
-/+ resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca01" -> (known after apply)
        name                             = "vmxwctestca01"
      ~ network_interface_ids            = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwctestca01",
        ] -> (known after apply)
      ~ resource_group_name              = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                             = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
            "UpdateClass"      = "test"
        }
      ~ vm_size                          = "Standard_D4_v4" -> "Standard_D4_V4"
        # (5 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [] -> (known after apply)
          ~ principal_id = "6938df86-c927-4c60-a265-ee1f7c210f11" -> (known after apply)
          ~ type         = "SystemAssigned" -> (known after apply)
        }

      ~ os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


      ~ storage_data_disk {
          ~ caching                   = "None" -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/data-vmxwctestca01" -> (known after apply)
            name                      = "data-vmxwctestca01"
            # (5 unchanged attributes hidden)
        }


      ~ storage_os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/os-vmxwctestca01" -> (known after apply)
            name                      = "os-vmxwctestca01"
          ~ os_type                   = "Windows" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine.VM["vmxwctestca02"] must be replaced
-/+ resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca02" -> (known after apply)
        name                             = "vmxwctestca02"
      ~ network_interface_ids            = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwctestca02",
        ] -> (known after apply)
      ~ resource_group_name              = "rg-xwc-core-001" -> "rg-xwc-app-001" # forces replacement
        tags                             = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
            "UpdateClass"      = "test"
        }
      ~ vm_size                          = "Standard_D4_v4" -> "Standard_D4_V4"
        # (5 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [] -> (known after apply)
          ~ principal_id = "20bee115-e606-4d80-b339-060e02f939aa" -> (known after apply)
          ~ type         = "SystemAssigned" -> (known after apply)
        }

      ~ os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


      ~ storage_data_disk {
          ~ caching                   = "None" -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/data-vmxwctestca02" -> (known after apply)
            name                      = "data-vmxwctestca02"
            # (5 unchanged attributes hidden)
        }


      ~ storage_os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/disks/os-vmxwctestca02" -> (known after apply)
            name                      = "os-vmxwctestca02"
          ~ os_type                   = "Windows" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwcca01"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AVEXT" {
      - automatic_upgrade_enabled  = false -> null
      ~ id                         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca01/extensions/IaaSAntimalware" -> (known after apply)
        name                       = "IaaSAntimalware"
      ~ settings                   = jsonencode( # whitespace changes
            {
                AntimalwareEnabled        = true
                Exclusions                = {
                    Extensions = ""
                    Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                    Processes  = "NTUser.dat*"
                }
                RealtimeProtectionEnabled = "true"
                ScheduledScanSettings     = {
                    day       = "7"
                    isEnabled = "true"
                    scanType  = "Quick"
                    time      = "120"
                }
            }
        )
        tags                       = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca01" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwcca02"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AVEXT" {
      - automatic_upgrade_enabled  = false -> null
      ~ id                         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca02/extensions/IaaSAntimalware" -> (known after apply)
        name                       = "IaaSAntimalware"
      ~ settings                   = jsonencode( # whitespace changes
            {
                AntimalwareEnabled        = true
                Exclusions                = {
                    Extensions = ""
                    Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                    Processes  = "NTUser.dat*"
                }
                RealtimeProtectionEnabled = "true"
                ScheduledScanSettings     = {
                    day       = "7"
                    isEnabled = "true"
                    scanType  = "Quick"
                    time      = "120"
                }
            }
        )
        tags                       = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwcca02" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwctestca01"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AVEXT" {
      - automatic_upgrade_enabled  = false -> null
      ~ id                         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca01/extensions/IaaSAntimalware" -> (known after apply)
        name                       = "IaaSAntimalware"
      ~ settings                   = jsonencode( # whitespace changes
            {
                AntimalwareEnabled        = true
                Exclusions                = {
                    Extensions = ""
                    Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                    Processes  = "NTUser.dat*"
                }
                RealtimeProtectionEnabled = "true"
                ScheduledScanSettings     = {
                    day       = "7"
                    isEnabled = "true"
                    scanType  = "Quick"
                    time      = "120"
                }
            }
        )
        tags                       = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
      ~ virtual_machine_id         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca01" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_virtual_machine_extension.AVEXT["vmxwctestca02"] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "AVEXT" {
      - automatic_upgrade_enabled  = false -> null
      ~ id                         = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Compute/virtualMachines/vmxwctestca02/extensions/IaaSAntimalware" -> (known after apply)
        name                       = "IaaSAntimalware"
      ~ settings                   = jsonencode( # whitespace changes
            {
                AntimalwareEnabled        = true
                Exclusions                = {
                    Extensions = ""
                    Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                    Processes  = "NTUser.